wjw890912/Power-measurementV0.2/ADE7878_NUC422_Softwave/NUC472_NUC442_BSP_CMSIS_V3.01.000/NUC400SeriesBSP_CMSIS_V3.01.000/Library/UsbHostLib/SOURCE/Hid/hid_core.c
/**************************************************************************//**
 * @file     hid_core.c
 * @version  V1.00
 * $Revision: 7 $
 * $Date: 14/05/29 4:23p $ 
 * @brief    NUC472/NUC442 MCU USB Host HID library core
 *
 * @note
 * Copyright (C) 2013 Nuvoton Technology Corp. All rights reserved.
*****************************************************************************/   

#include <stdio.h>
#include <string.h>
#include <stdlib.h>

#include "NUC472_442.h"
#include "usbh_core.h"

#include "usbh_hid.h"
#include "hid.h"


/** @addtogroup NUC472_442_Device_Driver NUC472/NUC442 Device Driver
  @{
*/

/** @addtogroup NUC472_442_USBH_HID_Driver USB Host HID Driver
  @{
*/

/** @addtogroup NUC472_442_USBH_HID_EXPORTED_FUNCTIONS USB Host HID Driver Exported Functions
  @{
*/


/// @cond HIDDEN_SYMBOLS

#define STATIC_MEMORY

#ifdef STATIC_MEMORY
static HIDParser  g_hid_parser_buff;
static int        g_hid_parser_used = 0;
static HIDData    g_hid_data_buff;
static int        g_hid_data_used = 0;
static HIDInterface g_hid_intf_buff;
static int        g_hid_intf_used = 0;
#endif



int usb_snd_control_msg(int dev_handle, int requesttype, int request, 
                    int value, int index, char *bytes, int size, int timeout)
{
    HID_DEV_T       *hid_dev;
    USB_DEV_T       *udev;
    
    hid_dev = find_hid_deivce_by_handle(dev_handle);
    if (hid_dev == NULL)
        return -1;
        
    udev = hid_dev->udev;
        
    return USBH_SendCtrlMsg(udev, usb_sndctrlpipe(udev, 0),
            request, requesttype, value, index, bytes, size, timeout);
}

int usb_rcv_control_msg(int dev_handle, int requesttype, int request, 
                    int value, int index, char *bytes, int size, int timeout)
{
    HID_DEV_T       *hid_dev;
    USB_DEV_T       *udev;
    
    hid_dev = find_hid_deivce_by_handle(dev_handle);
    if (hid_dev == NULL)
        return -1;
        
    udev = hid_dev->udev;
        
    return USBH_SendCtrlMsg(udev, usb_rcvctrlpipe(udev, 0),
            request, requesttype, value, index, bytes, size, timeout);
}

void hid_reset_HIDInterface(HIDInterface*   const   hidif)
{
    hidif->dev_handle = 0;
    hidif->interface = -1;
    hidif->id[0] = '\0';
    hidif->hid_data = NULL;
    hidif->hid_parser = NULL;
}

HIDInterface*  hid_new_HIDInterface()
{
#ifdef STATIC_MEMORY    
    HIDInterface*   ret;
    
    if (g_hid_intf_used)
    {
        HID_DBGMSG("hid_new_HIDInterface mallo failed! %d\n", sizeof(HIDInterface));
        return NULL;
    }
    else
    {
        g_hid_intf_used = 1;
        ret = &g_hid_intf_buff;
    }
#else
    HIDInterface*   ret =   (HIDInterface*)malloc(sizeof(HIDInterface));

    if (!ret)   
    {
        HID_DBGMSG("hid_new_HIDInterface mallo failed!\n");
        return NULL;
    }
#endif

    hid_reset_HIDInterface(ret);
    return ret;
}


void hid_delete_HIDInterface(HIDInterface** ixs)
{
    if (!ixs || !*ixs) 
    {
        return;
    }
#ifdef STATIC_MEMORY    
    g_hid_intf_used = 0;
#else
    free(*ixs);
#endif  
    *ixs = 0;
}


int hid_is_opened(HIDInterface * hidif)
{
  if (!hidif) HID_DBGMSG("attempt to query open status of NULL HIDInterface.");
  return hidif && hidif->dev_handle;
}


/*! TODO: This code does not seem to properly retrieve descriptors for devices
 * with multiple interfaces. We probably need to parse each interface a little
 * more to determine which endpoints we want to talk to with usb_control_msg
 * (EP1IN can't be right for everything).
 */
static hid_return hid_prepare_hid_descriptor(HIDInterface* const hidif)
{
    /* TODO: BUFLEN seems to depend on the device, so we need to do something
     * about the following.
     */
#define BUFLEN          9
    uint8_t     buffer[BUFLEN];
    int         len;
    
    len = usb_rcv_control_msg(hidif->dev_handle,
            USB_ENDPOINT_IN+1,
            USB_REQ_GET_DESCRIPTOR,
            (USB_DT_HID << 8) + 0, hidif->interface,
            (char*)buffer, BUFLEN,
            USB_TIMEOUT);

    if (len < 0) {
        HID_DBGMSG("failed to get HID descriptor.\n");
        return HID_RET_NOT_HID_DEVICE;
    }

    if (len < BUFLEN) {
        HID_DBGMSG("HID descriptor is too short; expected: %d bytes; got: %d bytes.\n", BUFLEN, len);
        return HID_RET_HID_DESC_SHORT;
    }

    /* TODO:
     * the constants 7 and 8 should be exported.
     */
    hidif->hid_parser->ReportDescSize = buffer[7] | (buffer[8] << 8);

    HID_DBGMSG("successfully initialised HID descriptor %d bytes.\n",
            hidif->hid_parser->ReportDescSize);

    return HID_RET_SUCCESS;
}


static hid_return hid_prepare_report_descriptor(HIDInterface* const hidif)
{
    int     len;
    
    if (hidif->hid_parser->ReportDescSize > REPORT_DSC_SIZE) 
    {
        HID_DBGMSG("report descriptor size exceeds maximum size: %d > %d.\n", hidif->hid_parser->ReportDescSize, REPORT_DSC_SIZE);
        return HID_RET_REPORT_DESC_LONG;
    }

    len = usb_rcv_control_msg(hidif->dev_handle,
            USB_ENDPOINT_IN+1,
            USB_REQ_GET_DESCRIPTOR,
            (USB_DT_REPORT << 8) + 0, hidif->interface,
            (char*)hidif->hid_parser->ReportDesc, hidif->hid_parser->ReportDescSize,
            USB_TIMEOUT);

    if (len < 0) {
        HID_DBGMSG("failed to get report descriptor\n");
        return HID_RET_FAIL_GET_REPORT;
    }

    if (len < hidif->hid_parser->ReportDescSize) {
        HID_DBGMSG("HID report descriptor is too short expected: %d bytes; got: %d bytes.\n", hidif->hid_parser->ReportDescSize, len);
        return HID_RET_REPORT_DESC_SHORT;
    }
    HID_DBGMSG("successfully initialised report descriptor.");
    return HID_RET_SUCCESS;
}


hid_return hid_init_parser(HIDInterface* const hidif)
{
#ifdef STATIC_MEMORY    

    if (g_hid_data_used)
    {
        HID_DBGMSG("failed to allocate memory for HIDData %d\n", sizeof(HIDData));
        return HID_RET_FAIL_ALLOC;
    }
    else
    {
        hidif->hid_data = &g_hid_data_buff;
        g_hid_data_used = 1;
    }

    if (g_hid_parser_used)
    {
        HID_DBGMSG("failed to allocate memory for HIDParser %d\n", sizeof(HIDParser));
        return HID_RET_FAIL_ALLOC;
    }
    else
    {
        g_hid_parser_used = 1;
        hidif->hid_parser = &g_hid_parser_buff;
    }
#else
    hidif->hid_data = (HIDData*)malloc(sizeof(HIDData));
    if (!hidif->hid_data) 
    {
        HID_DBGMSG("failed to allocate memory for HIDData\n");
        return HID_RET_FAIL_ALLOC;
    }

    hidif->hid_parser = (HIDParser*)malloc(sizeof(HIDParser));
    if (!hidif->hid_parser) 
    {
        HID_DBGMSG("failed to allocate memory for HIDParser %d\n", sizeof(HIDParser));
        return HID_RET_FAIL_ALLOC;
    }
#endif  
    return HID_RET_SUCCESS;
}


hid_return hid_prepare_interface(HIDInterface* const hidif)
{
    hid_return  ret;
    
