wjw890912/Power-measurementV0.2/ADE7878_NUC422_Softwave/NUC472_NUC442_BSP_CMSIS_V3.01.000/NUC400SeriesBSP_CMSIS_V3.01.000/Library/UsbHostLib/SOURCE/Hid/hid_core.c
    ret = hid_init_parser(hidif);
    if (ret != HID_RET_SUCCESS) 
    {
        USBH_HidClose((int32_t)hidif);
        return ret;
    }

    ret = hid_prepare_hid_descriptor(hidif);
    if (ret != HID_RET_SUCCESS) 
    {
        USBH_HidClose((int32_t)hidif);
        return ret;
    }

    ret = hid_prepare_report_descriptor(hidif);
    if (ret != HID_RET_SUCCESS) {
    USBH_HidClose((int32_t)hidif);
    return ret;
    }

    ret = hid_prepare_parser(hidif);
    if (ret != HID_RET_SUCCESS) {
    USBH_HidClose((int32_t)hidif);
    return ret;
    }
    return HID_RET_SUCCESS;
}

/// @endcond /* HIDDEN_SYMBOLS */

/*!@brief Send a control message to retrieve an entire input report
 *
 * To use an interrupt endpoint instead of EP0, use hid_interrupt_read().
 *
 * @param[in] i32Hanlde  HID interface hanlde
 * @param[in] path       Path to input item (to find Report ID)
 * @param[in] depth      See hid_find_object()
 * @param[out] buffer    Result is stored here
 * @param[in] size       How many bytes to fetch
 * @retval   0   Success
 * @retval   Otherwise   Failed
 */
int32_t USBH_HidGetInputReport(int32_t i32Hanlde, int path[], uint32_t depth, char* buffer, uint32_t size)
{
    HIDInterface * hidif = (HIDInterface *)i32Hanlde;
    int  len;
    
    //ASSERT(hid_is_initialised());
    //ASSERT(hid_is_opened(hidif));
    ///ASSERT(buffer);

    if (!buffer) return HID_RET_INVALID_PARAMETER;

    if (!hid_is_opened(hidif)) {
        HID_DBGMSG("the device has not been opened.\n");
        return HID_RET_DEVICE_NOT_OPENED;
    }

    HID_DBGMSG("looking up report ID...\n");
    hidif->hid_data->Type = ITEM_INPUT;
    hidif->hid_data->ReportID = 0;

    hid_find_object(hidif, path, depth);

    HID_DBGMSG("retrieving report ID 0x%02x (length: %d)...\n", 
                hidif->hid_data->ReportID, size);

    len = usb_rcv_control_msg(hidif->dev_handle,
            USB_ENDPOINT_IN + USB_TYPE_CLASS + USB_RECIP_INTERFACE,
            HID_REPORT_GET,
            hidif->hid_data->ReportID + (HID_RT_INPUT << 8),
            hidif->interface,
            buffer, size, USB_TIMEOUT);

    if (len < 0) {
        HID_DBGMSG("failed to retrieve report!\n");
        return HID_RET_FAIL_GET_REPORT;
    }

    if (len != (signed)size) {
        HID_DBGMSG("failed to retrieve complete report; "
                "requested: %d bytes, got: %d bytes.\n", size, len);
        return HID_RET_FAIL_GET_REPORT;
    }

    HID_DBGMSG("successfully retrieved report.\n");
    return HID_RET_SUCCESS;
}


/*!@brief Send an entire output report to the device
 *
 * This routine uses a control message to send the report. To use an interrupt
 * endpoint, use hid_interrupt_write().
 *
 * @param[in] i32Hanlde  HID interface handle
 * @param[in] path       Path to an output item (to find Report ID)
 * @param[in] depth      See hid_find_object()
 * @param[in] buffer     Output Report
 * @param[in] size       How many bytes to send
 * @retval   0           Success
 * @retval   Otherwise   Failed
 */
int32_t USBH_HidSetOutputReport(int32_t i32Hanlde, int path[],
                                    uint32_t depth, char *buffer, uint32_t size)
{
    HIDInterface * hidif = (HIDInterface *)i32Hanlde;
    int   len;
    
    //ASSERT(hid_is_initialised());
    //ASSERT(hid_is_opened(hidif));
    //ASSERT(buffer);

    if (!buffer) return HID_RET_INVALID_PARAMETER;

    if (!hid_is_opened(hidif)) {
        HID_DBGMSG("the device has not been opened.\n");
        return HID_RET_DEVICE_NOT_OPENED;
    }

    HID_DBGMSG("looking up report ID...\n");
    hidif->hid_data->Type = ITEM_OUTPUT;
    hidif->hid_data->ReportID = 0;

    hid_find_object(hidif, path, depth);

    HID_DBGMSG("sending report ID 0x%02x (length: %d)...\n", hidif->hid_data->ReportID, size);

    len = usb_snd_control_msg(hidif->dev_handle,
            USB_ENDPOINT_OUT + USB_TYPE_CLASS + USB_RECIP_INTERFACE,
            HID_REPORT_SET,
            hidif->hid_data->ReportID + (HID_RT_OUTPUT << 8),
            hidif->interface,
            (char*)buffer, size, USB_TIMEOUT);

    if (len < 0) {
        HID_DBGMSG("failed to send report.\n");
        return HID_RET_FAIL_SET_REPORT;
    }

    if (len != (signed)size) 
    {
        HID_DBGMSG("failed to send complete report; "
                "requested: %d bytes, sent: %d bytes.\n", size, len);
        return HID_RET_FAIL_SET_REPORT;
    }

    HID_DBGMSG("successfully sent report.\n");
    return HID_RET_SUCCESS;
}


/*!@brief Send a control message to retrieve an entire feature report
 *
 * To use an interrupt endpoint instead of EP0, use hid_interrupt_read().
 *
 * @param[in] i32Hanlde  HID interface handle
 * @param[in] path       Path to input item (to find Report ID)
 * @param[in] depth      See hid_find_object()
 * @param[out] buffer    Result is stored here
 * @param[in] size       How many bytes to fetch
 * @retval   0           Success
 * @retval   Otherwise   Failed
 */
int32_t USBH_HidGetFeatureReport(int32_t i32Hanlde, int path[],
                                    uint32_t depth, char *buffer, uint32_t size)
{
    HIDInterface * hidif = (HIDInterface *)i32Hanlde;
    int   len;
    
    //ASSERT(hid_is_initialised());
    //ASSERT(hid_is_opened(hidif));
    //ASSERT(buffer);

    if (!buffer) return HID_RET_INVALID_PARAMETER;

    if (!hid_is_opened(hidif)) {
        HID_DBGMSG("the device has not been opened.\n");
        return HID_RET_DEVICE_NOT_OPENED;
    }

    HID_DBGMSG("looking up report ID...\n");
    hidif->hid_data->Type = ITEM_FEATURE;
    hidif->hid_data->ReportID = 0;

    hid_find_object(hidif, path, depth);

    HID_DBGMSG("retrieving report ID 0x%02x (length: %d)...\n", hidif->hid_data->ReportID, size);

    len = usb_rcv_control_msg(hidif->dev_handle,
            USB_ENDPOINT_IN + USB_TYPE_CLASS + USB_RECIP_INTERFACE,
            HID_REPORT_GET,
            hidif->hid_data->ReportID + (HID_RT_FEATURE << 8),
            hidif->interface,
            buffer, size, USB_TIMEOUT);

    if (len < 0) {
        HID_DBGMSG("failed to retrieve report!\n");
        return HID_RET_FAIL_GET_REPORT;
    }

