wjw890912/Power-measurementV0.2/ADE7878_NUC422_Softwave/NUC472_NUC442_BSP_CMSIS_V3.01.000/NUC400SeriesBSP_CMSIS_V3.01.000/Library/UsbHostLib/SOURCE/Hid/hid_core.c
    if (len != (signed)size) {
        HID_DBGMSG("failed to retrieve complete report; "
                "requested: %d bytes, got: %d bytes.", size, len);
        return HID_RET_FAIL_GET_REPORT;
    }

    HID_DBGMSG("successfully retrieved report.\n");
    return HID_RET_SUCCESS;
}


/*!@brief Send an entire feature report to the device
 *
 * This routine uses a control message to send the report. To use an interrupt
 * endpoint, use hid_interrupt_write().
 *
 * @param[in] i32Hanlde  HID interface handle
 * @param[in] path       Path to an output item (to find Report ID)
 * @param[in] depth      See hid_find_object()
 * @param[in] buffer     Output Report
 * @param[in] size       How many bytes to send
 * @retval   0           Success
 * @retval   Otherwise   Failed
 */
int32_t USBH_HidSetFeatureReport(int32_t i32Hanlde, int path[],
                                    uint32_t depth, char * buffer, uint32_t size)
{
    HIDInterface * hidif = (HIDInterface *)i32Hanlde;
    int   len;
    
    //ASSERT(hid_is_initialised());
    //ASSERT(hid_is_opened(hidif));
    //ASSERT(buffer);

    if (!buffer) return HID_RET_INVALID_PARAMETER;

    if (!hid_is_opened(hidif)) {
        HID_DBGMSG("the device has not been opened.\n");
        return HID_RET_DEVICE_NOT_OPENED;
    }

    HID_DBGMSG("looking up report ID...\n");
    hidif->hid_data->Type = ITEM_FEATURE;
    hidif->hid_data->ReportID = 0;

    hid_find_object(hidif, path, depth);

    HID_DBGMSG("sending report ID 0x%02x (length: %d)...\n",  hidif->hid_data->ReportID, size);

    len = usb_snd_control_msg(hidif->dev_handle,
            USB_ENDPOINT_OUT + USB_TYPE_CLASS + USB_RECIP_INTERFACE,
            HID_REPORT_SET,
            hidif->hid_data->ReportID + (HID_RT_FEATURE << 8),
            hidif->interface,
            (char*)buffer, size, USB_TIMEOUT);

    if (len < 0) {
        HID_DBGMSG("failed to send report.\n");
        return HID_RET_FAIL_SET_REPORT;
    }

    if (len != (signed)size) {
        HID_DBGMSG("failed to send complete report; "
                "requested: %d bytes, sent: %d bytes.\n", size, len);
        return HID_RET_FAIL_SET_REPORT;
    }

    HID_DBGMSG("successfully sent report.\n");
    return HID_RET_SUCCESS;
}


/*!@brief HID Set Report command
 *
 * @param[in] i32Hanlde  HID interface handle
 * @param[in] ReportID   The Report ID
 * @param[in] buffer     Data buffer to be written.
 * @param[in] size       How many bytes to send
 * @retval   0           Success
 * @retval   Otherwise   Failed
 */
int32_t USBH_HidSetReport(int32_t i32Hanlde, int ReportID, char * buffer, uint32_t size)
{
    HIDInterface * hidif = (HIDInterface *)i32Hanlde;
    int   len;
    
    if (!buffer) return HID_RET_INVALID_PARAMETER;

    if (!hid_is_opened(hidif)) {
        HID_DBGMSG("the device has not been opened.\n");
        return HID_RET_DEVICE_NOT_OPENED;
    }

    HID_DBGMSG("looking up report ID...\n");
    hidif->hid_data->Type = ITEM_FEATURE;
    hidif->hid_data->ReportID = 0;

    HID_DBGMSG("sending report ID 0x%02x (length: %d)...\n",  hidif->hid_data->ReportID, size);
    
    len = usb_snd_control_msg(hidif->dev_handle,
            USB_ENDPOINT_OUT + USB_TYPE_CLASS + USB_RECIP_INTERFACE,
            HID_REPORT_SET,
            ReportID + (HID_RT_OUTPUT << 8),
            hidif->interface,
            buffer, size, USB_TIMEOUT);

    if (len < 0) {
        HID_DBGMSG("failed to send report.\n");
        return HID_RET_FAIL_SET_REPORT;
    }

    if (len != (signed)size) {
        HID_DBGMSG("failed to send complete report; "
                "requested: %d bytes, sent: %d bytes.\n", size, len);
        return HID_RET_FAIL_SET_REPORT;
    }

    HID_DBGMSG("successfully sent report.\n");
    return HID_RET_SUCCESS;
}

/// @cond HIDDEN_SYMBOLS

/*!
 * Extract data from a report stored in Buf.
 * Use Value, Offset, Size and LogMax of pData.
 * @return Response in pData->Value.
 *
 * TODO: Fix this "+8" business if there is only one report ID
 */
void GetValue(uint8_t *Buf, HIDData* pData)
{
    int     Bit = pData->Offset+8; /* First byte of report indicate report ID */
    int     Weight = 0;
    int     State;

    pData->Value = 0;

    while (Weight < pData->Size)
    {
        State = Buf[Bit>>3] & (1 << (Bit % 8));
        if (State)
        {
            pData->Value += (1 << Weight);
        }
        Weight++;
        Bit++;
    }
/*  if(pData->Value > pData->LogMax)
        pData->Value=FormatValue(pData->Value, (uchar)((pData->Size-1)/8+1));
*/
    if (pData->Value > pData->LogMax)
        pData->Value |= ~pData->LogMax;
}


hid_return hid_extract_value(HIDInterface* hidif, uint8_t *buffer, double *value)
{
    if (!hid_is_opened(hidif)) {
        HID_DBGMSG("cannot extract value from unopened HIDinterface.\n");
        return HID_RET_DEVICE_NOT_OPENED;
    }
    //ASSERT(hidif->hid_parser);
    //ASSERT(hidif->hid_data);

    if (!buffer) {
        HID_DBGMSG("cannot extract value into NULL raw buffer.\n");
        return HID_RET_INVALID_PARAMETER;
    }

    if (!value) {
        HID_DBGMSG("cannot extract value into NULL value buffer.\n");
        return HID_RET_INVALID_PARAMETER;
    }
    
    /* Extract the data value */
    GetValue(buffer, hidif->hid_data);

    /* FIXME: unit conversion and exponent?! */
    *value = hidif->hid_data->Value;
    
    return HID_RET_SUCCESS;
}

/// @endcond /* HIDDEN_SYMBOLS */

/**
  * @brief  Get size of a report
 *  @param[in] i32Hanlde   HID interface handle
 *  @param[in] reportID    Report ID
 *  @param[in] reportType  Report type
 *  @param[out] size       the return size of report.
 * @retval   0           Success
 * @retval   Otherwise   Failed
 */
int32_t USBH_HidGetReportSize(int32_t i32Hanlde, uint32_t reportID, 
                                    uint32_t reportType, uint32_t *size)
{
    HIDInterface * hidif = (HIDInterface *)i32Hanlde;

    if (!hid_is_opened(hidif)) {
        HID_DBGMSG("cannot get report size of unopened HIDinterface.\n");
        return HID_RET_DEVICE_NOT_OPENED;
    }
    //ASSERT(hidif->hid_parser);
    //ASSERT(hidif->hid_data);
    
