wjw890912/Power-measurementV0.2/ADE7878_NUC422_Softwave/NUC472_NUC442_BSP_CMSIS_V3.01.000/NUC400SeriesBSP_CMSIS_V3.01.000/Library/UsbHostLib/SOURCE/Hid/hid_core.c
    if (!size) {
        HID_DBGMSG("cannot read report size into NULL size buffer.\n");
        return HID_RET_INVALID_PARAMETER;
    }
    
    /* FIXME: GetReportOffset has to be rewritten! */
    *size = *GetReportOffset(hidif->hid_parser, reportID, reportType);
    
    return HID_RET_SUCCESS;
}

/*!@brief Retrieve a numeric input item
 *
 * @param[in] i32Hanlde  HID interface handle
 * @param[in] path       Path to input item
 * @param[in] depth      See hid_find_object()
 * @param[out] value     Result from hid_extract_value()
 * @retval   0           Success
 * @retval   Otherwise   Failed
 *
 * TODO: Handle exponent and unit conversion (separate library?)
 */
int32_t USBH_HidGetItemValue(int32_t i32Hanlde, int path[], uint32_t depth, double *value)
{
    HIDInterface * hidif = (HIDInterface *)i32Hanlde;
    uint32_t    size;
    uint8_t     buffer[32]; /* TODO: Dynamically allocate the item buffer */
    int   len;
    
    //ASSERT(hid_is_initialised());
    //ASSERT(hid_is_opened(hidif));

    if (!hid_is_opened(hidif)) {
        HID_DBGMSG("the device has not been opened.\n");
        return HID_RET_DEVICE_NOT_OPENED;
    }

    HID_DBGMSG("retrieving report...\n");
    hidif->hid_data->Type = ITEM_FEATURE;
    hidif->hid_data->ReportID = 0;

    /* TODO: i think this and the buffer stuff should be passed in */
    hid_find_object(hidif, path, depth);
    USBH_HidGetReportSize((int32_t)hidif, hidif->hid_data->ReportID,
            hidif->hid_data->Type, &size);

    //ASSERT(size <= 32); /* remove when buffer situation is fixed. */

    len = usb_rcv_control_msg(hidif->dev_handle,
            USB_ENDPOINT_IN + USB_TYPE_CLASS + USB_RECIP_INTERFACE,
            HID_REPORT_GET,
            hidif->hid_data->ReportID + (HID_RT_FEATURE << 8),
            hidif->interface,
            (char*)buffer, size, USB_TIMEOUT);

    if (len < 0) {
        HID_DBGMSG("failed to retrieve report.\n");
        return HID_RET_FAIL_GET_REPORT;
    }

    if ((unsigned)len != size) {
        HID_DBGMSG("failed to retrieve complete report; "
                "requested: %d bytes, got: %d bytes.\n", size, len);
        return HID_RET_FAIL_GET_REPORT;
    }

    if (hid_extract_value(hidif, buffer, value) != HID_RET_SUCCESS) {
        return HID_RET_FAIL_GET_REPORT;
    }

    HID_DBGMSG("successfully retrieved report.\n");
    return HID_RET_SUCCESS;
}


/*!@brief Execute a Set_Idle request on an Interrupt In pipe
 *
 * This is used to tell a device not to send reports unless something has
 * changed (duration = 0), or unless a minimum time interval has passed.
 *
 * @param[in] i32Hanlde  HID interface handle
 * @param[in] duration   0 for indefinite, otherwise in increments of 4 ms (to 1020 ms)
 * @param[in] report_id  0 for all reports, otherwise a Report ID
 * @retval   0           Success
 * @retval   Otherwise   Failed
 */
int32_t USBH_HidSetIdle(int32_t i32Hanlde, uint32_t duration, uint32_t report_id) 
{
    HIDInterface * hidif = (HIDInterface *)i32Hanlde;
    int   len;
    
    if (duration > 255) {
        HID_DBGMSG("duration must be in the range [0,255]\n");
        return HID_RET_INVALID_PARAMETER;
    }

    if (report_id > 255) {
        HID_DBGMSG("Report ID must be in the range [0,255]\n");
        return HID_RET_INVALID_PARAMETER;
    }

    len = usb_snd_control_msg(hidif->dev_handle,
            USB_TYPE_CLASS + USB_RECIP_INTERFACE,
            HID_SET_IDLE,
            report_id + ((duration & 0xff) << 8),
            hidif->interface,
            NULL, 0, USB_TIMEOUT);

    if (len != 0) {
        HID_DBGMSG("failed to Set_Idle!\n");
        return HID_RET_FAIL_GET_REPORT;
    }

    return HID_RET_SUCCESS;
}


/// @cond HIDDEN_SYMBOLS

/* 
 * HID INT-in complete function 
 */
static void  hid_read_irq(URB_T *urb)
{
    HIDInterface  *hidif = (HIDInterface *)urb->context;
    HID_DEV_T   *hid_dev;

    //HID_DBGMSG("hid_read_irq. %d\n", urb->actual_length);

    if (!hid_is_opened(hidif)) 
    {
        HID_DBGMSG("hid_read_irq - the device have been closed!\n");
        return;
    }

    hid_dev = find_hid_deivce_by_handle(hidif->dev_handle);
    if (hid_dev == NULL)
        return;
    
    if (urb->status)
    {
        HID_DBGMSG("hid_read_irq - has error: 0x%x\n", urb->status);
        return; 
    }

    if (hid_dev->read_func && urb->actual_length)
        hid_dev->read_func(urb->transfer_buffer, urb->actual_length);
}

/// @endcond /* HIDDEN_SYMBOLS */


/**
 * @brief  Start purge the USB interrupt in transfer.
 *  @param[in] i32Hanlde   HID interface handle.
 *  @param[in] func        The interrupt in data receiver callback function.
 * @retval   0           Success
 * @retval   Otherwise   Failed
 */
int32_t USBH_HidStartIntReadPipe(int32_t i32Hanlde, HID_INT_READ_FUNC *func)
{
    HIDInterface * hidif = (HIDInterface *)i32Hanlde;
    HID_DEV_T   *hid_dev;
    EP_INFO_T   *ep_info;
    URB_T       *urb;
    uint32_t    pipe;
    USB_DEV_T   *udev;
    int         maxp, ret;

    if (!func)
        return HID_RET_INVALID_PARAMETER;
    
    if (!hid_is_opened(hidif)) {
        HID_DBGMSG("the device has not been opened.\n");
        return HID_RET_DEVICE_NOT_OPENED;
    }
    
    hid_dev = find_hid_deivce_by_handle(hidif->dev_handle);
    if (hid_dev == NULL)
        return HID_RET_DEVICE_NOT_FOUND;
    udev = hid_dev->udev;
        
    if (hid_dev->urbin)
        return HID_RET_OUT_OF_SPACE;
        
    ep_info = hid_get_ep_info(hid_dev->udev, hid_dev->ifnum, USB_DIR_IN);
    if (ep_info == NULL)
    {
        HID_DBGMSG("Interrupt-in endpoint not found in this device!\n");
        return HID_RET_INVALID_PARAMETER;
    }
    
    urb = USBH_AllocUrb();
    if (urb == NULL)
    {
        HID_DBGMSG("Failed to allocated URB!\n");
        return HID_RET_OUT_OF_SPACE;
    }   
    
    pipe = usb_rcvintpipe(udev, ep_info->bEndpointAddress);
    maxp = usb_maxpacket(udev, pipe, usb_pipeout(pipe));
    
    HID_DBGMSG("Endpoint 0x%x maximum packet size is %d.\n", ep_info->bEndpointAddress, maxp);
    
