wjw890912/Power-measurementV0.2/ADE7878_NUC422_Softwave/NUC472_NUC442_BSP_CMSIS_V3.01.000/NUC400SeriesBSP_CMSIS_V3.01.000/Library/UsbHostLib/SOURCE/Hid/hid_core.c
    FILL_INT_URB(urb, udev, pipe, &hid_dev->inbuf[0], maxp, hid_read_irq,
                hidif, ep_info->bInterval);

    hid_dev->urbin = urb;
    hid_dev->read_func = func;

    ret = USBH_SubmitUrb(urb);
    if (ret) 
    {
        HID_DBGMSG("Error - failed to submit interrupt read request (%d)", ret);
        USBH_FreeUrb(urb);
        hid_dev->urbin = NULL;
        return HID_RET_IO_ERR;
    }
    
    return HID_RET_SUCCESS;
}


/* 
 * HID INT-out complete function 
 */
static void  hid_write_irq(URB_T *urb)
{
    HIDInterface  *hidif = (HIDInterface *)urb->context;
    HID_DEV_T     *hid_dev;

    //HID_DBGMSG("hid_write_irq. %d\n", urb->actual_length);

    if (!hid_is_opened(hidif)) 
    {
        HID_DBGMSG("hid_write_irq - the device have been closed, terminate it.\n");
        return;
    }

    hid_dev = find_hid_deivce_by_handle(hidif->dev_handle);
    if (hid_dev == NULL)
        return;
    
    if (urb->status)
    {
        HID_DBGMSG("hid_write_irq - has error: 0x%x\n", urb->status);
        return; 
    }

    if (hid_dev->write_func)
        hid_dev->write_func((uint8_t **)&urb->transfer_buffer, &urb->transfer_buffer_length);
}


/**
  * @brief  Start purge the USB interrupt out transfer.
 *  @param[in] i32Hanlde   HID interface handle.
 *  @param[in] func        The interrupt in data transfer callback function.
 *  @retval   0           Success
 *  @retval   Otherwise   Failed
 */
int32_t USBH_HidStartIntWritePipe(int32_t i32Hanlde, HID_INT_WRITE_FUNC *func)
{
    HIDInterface * hidif = (HIDInterface *)i32Hanlde;
    HID_DEV_T   *hid_dev;
    EP_INFO_T   *ep_info;
    URB_T       *urb;
    uint32_t    pipe;
    USB_DEV_T   *udev;
    int         maxp, ret;
    
    if (!func)
        return HID_RET_INVALID_PARAMETER;
    
    if (!hid_is_opened(hidif)) {
        HID_DBGMSG("the device has not been opened.\n");
        return HID_RET_DEVICE_NOT_OPENED;
    }
    
    hid_dev = find_hid_deivce_by_handle(hidif->dev_handle);
    if (hid_dev == NULL)
        return HID_RET_DEVICE_NOT_FOUND;
    udev = hid_dev->udev;
        
    if (hid_dev->urbout)
        return HID_RET_OUT_OF_SPACE;
        
    ep_info = hid_get_ep_info(hid_dev->udev, hid_dev->ifnum, USB_DIR_OUT);
    if (ep_info == NULL)
    {
        HID_DBGMSG("Assigned endpoint address 0x%x not found in this device!\n", ep_info->bEndpointAddress);
        return HID_RET_INVALID_PARAMETER;
    }
    
    urb = USBH_AllocUrb();
    if (urb == NULL)
    {
        HID_DBGMSG("Failed to allocated URB!\n");
        return HID_RET_OUT_OF_SPACE;
    }   
    
    pipe = usb_sndintpipe(udev, ep_info->bEndpointAddress);
    maxp = usb_maxpacket(udev, pipe, usb_pipeout(pipe));
    
    HID_DBGMSG("Endpoint 0x%x maximum packet size is %d.\n", ep_info->bEndpointAddress, maxp);
    
    FILL_INT_URB(urb, udev, pipe, NULL, maxp, hid_write_irq,
                                            hidif, ep_info->bInterval);

    func((uint8_t **)&urb->transfer_buffer, &urb->transfer_buffer_length);

    hid_dev->urbout = urb;
    hid_dev->write_func = func;

    ret = USBH_SubmitUrb(urb);
    if (ret) 
    {
        HID_DBGMSG("Error - failed to submit interrupt read request (%d)", ret);
        USBH_FreeUrb(urb);
        hid_dev->urbout = NULL;
        return HID_RET_IO_ERR;
    }
    
    return HID_RET_SUCCESS;
}

/// @cond HIDDEN_SYMBOLS

const char *hid_strerror(hid_return ret)
{
    switch(ret) {
        case HID_RET_SUCCESS:
            return "libhid: success";
        case HID_RET_INVALID_PARAMETER:
            return "libhid: invalid parameter";
        case HID_RET_NOT_INITIALISED:
            return "libhid: not initialized; call hid_init() first";
        case HID_RET_ALREADY_INITIALISED:
            return "libhid: hid_init() already called";
        case HID_RET_FAIL_FIND_BUSSES:
            return "libhid: failed to find any USB busses";
        case HID_RET_FAIL_FIND_DEVICES:
            return "libhid: failed to find any USB devices";
        case HID_RET_FAIL_OPEN_DEVICE:
            return "libhid: failed to open device";
        case HID_RET_DEVICE_NOT_FOUND:
            return "libhid: device not found";
        case HID_RET_DEVICE_NOT_OPENED:
            return "libhid: device not yet opened";
        case HID_RET_DEVICE_ALREADY_OPENED:
            return "libhid: device already opened";
        case HID_RET_FAIL_CLOSE_DEVICE:
            return "libhid: could not close device";
        case HID_RET_FAIL_CLAIM_IFACE:
            return "libhid: failed to claim interface; is another driver using it?";
        case HID_RET_FAIL_DETACH_DRIVER:
            return "libhid: failed to detach kernel driver";
        case HID_RET_NOT_HID_DEVICE:
            return "libhid: not recognized as a HID device";
        case HID_RET_HID_DESC_SHORT:
            return "libhid: HID interface descriptor too short";
        case HID_RET_REPORT_DESC_SHORT:
            return "libhid: HID report descriptor too short";
        case HID_RET_REPORT_DESC_LONG:
            return "libhid: HID report descriptor too long";
        case HID_RET_FAIL_ALLOC:
            return "libhid: failed to allocate memory";
        case HID_RET_OUT_OF_SPACE:
            return "libhid: no space left in buffer";
        case HID_RET_FAIL_SET_REPORT:
            return "libhid: failed to set report";
        case HID_RET_FAIL_GET_REPORT:
            return "libhid: failed to get report";
        case HID_RET_FAIL_INT_READ:
            return "libhid: interrupt read failed";
        case HID_RET_NOT_FOUND:
            return "libhid: not found";
        case HID_RET_TIMEOUT:
            return "libhid: timeout";
    }
    return "libhid: unknown error";
}

/// @endcond /* HIDDEN_SYMBOLS */


/**
  * @brief  Probe and open a HID device.
 *  @param[in] interface   The interface number of HID device.
 *  @param[in] matcher     The HID device search conditions.
 *  @param[in] handle      The return handle of HID device if matched.
 * @retval   0           Success
 * @retval   Otherwise   Failed
 */
int32_t USBH_HidOpen(int interface, HIDInterfaceMatcher *matcher, int32_t * handle)
{
    HIDInterface  * hidif;
    hid_return ret;
    
    if (!matcher)   {
        return HID_RET_INVALID_PARAMETER;
    }

    hidif = hid_new_HIDInterface();
    if (hidif == NULL) {
        return HID_RET_FAIL_ALLOC;
    }

