wjw890912/Power-measurementV0.2/ADE7878_NUC422_Softwave/NUC472_NUC442_BSP_CMSIS_V3.01.000/NUC400SeriesBSP_CMSIS_V3.01.000/Library/UsbHostLib/SOURCE/Hid/hid_core.c
    hidif->interface = interface;
    
    ret = usbh_hid_find_device(hidif, matcher);
    if (ret != HID_RET_SUCCESS)
    {
        hid_delete_HIDInterface(&hidif);
        return ret;
    }

    //HID_DBGMSG("claiming  USB device %s.", hidif->id);
    //if (usb_claim_interface(hidif->dev_handle, interface) <   0) {
    //  WARNING("failed to claim USB device %s.",   hidif->id);
    //  USBH_HidClose((int32_t)hidif);
    //  return HID_RET_FAIL_CLAIM_IFACE;
    //}
    //NOTICE("successfully claimed USB device   %s.",   hidif->id);

    ret = hid_prepare_interface(hidif);
    if (ret != HID_RET_SUCCESS) 
    {
        hid_delete_HIDInterface(&hidif);
        return ret;
    }
    
    *handle = (int32_t)hidif;

    return HID_RET_SUCCESS;
}

/**
 * @brief  Close a HID device. 
 * @retval   0           Success
 * @retval   Otherwise   Failed
 */

int32_t  USBH_HidClose(int32_t i32Hanlde)
{
    HIDInterface * hidif = (HIDInterface *)i32Hanlde;
    
    if (hidif->hid_parser) ResetParser(hidif->hid_parser);
        
#ifdef STATIC_MEMORY    
    g_hid_parser_used = 0;
    g_hid_data_used = 0;
#else
    if (hidif->hid_parser) free(hidif->hid_parser);
    if (hidif->hid_data) free(hidif->hid_data);
#endif
        
    hid_delete_HIDInterface(&hidif);
    return HID_RET_SUCCESS;
}


/*@}*/ /* end of group NUC472_442_USBH_HID_EXPORTED_FUNCTIONS */

/*@}*/ /* end of group NUC472_442_USBH_HID_Driver */

/*@}*/ /* end of group NUC472_442_Device_Driver */

/*** (C) COPYRIGHT 2013 Nuvoton Technology Corp. ***/


